Revit 2027 API
DimensionSegment.Above Property
The text shown above the segment's value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Above { get; set; }
Public Property Above As String
	Get
	Set
public:
property String^ Above {
	String^ get ();
	void set (String^ value);
}
member Above : string with get, set
Property Value
String
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace